---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
FormatOptions..::..CanHaveSymbol Method
FormatOptions Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | CanHaveSymbol()()()() | Checks whether a symbol can be specified to display the unit in this FormatOptions. |
|  | CanHaveSymbol(ForgeTypeId) | Checks whether a symbol can be specified to display a given unit. |

# See Also

FormatOptions Class

FormatOptions Members

Autodesk.Revit.DB Namespace